cf_billing/Catalogs/энргСоотвествиеПолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСоотвествиеПолей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьИзDBF</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Соответствие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргСоответствиеПолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСоответствиеПолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Справочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСоотвествиеПолей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргСоотвествиеПолей/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	Объект.Соответствие.Очистить();	
	Для каждого ТЧ Из Метаданные.Документы[Объект.Документ].ТабличныеЧасти Цикл
		Стр = Объект.Соответствие.Добавить();
		Стр.РеквизитДокумента = "Табличная часть: " + ТЧ;
		Для каждого Реквизит Из ТЧ.Реквизиты Цикл
			Стр = Объект.Соответствие.Добавить();
			Стр.РеквизитДокумента 	= Реквизит.Имя;
			Стр.Синоним 			= Реквизит.Синоним;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображениеЗаголовка();
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Для Каждого ТипДокумента Из Метаданные.Документы Цикл
		Имя = ТипДокумента.Имя;
		Синоним = ТипДокумента.Синоним;
		Элементы.Документ.СписокВыбора.Добавить(Имя,Синоним);
    КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	НаборЗаписей = РегистрыСведений.энргСоответствиеПолей.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Справочник.Установить(Объект.Ссылка); 
	
	Для Каждого СтрокаТаблицы Из Объект.Соответствие Цикл 
		Если ЗначениеЗаполнено(СтрокаТаблицы.НазваниеКолонки) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период 				= ТекущаяДата();
			НоваяЗапись.Справочник 			= Объект.Ссылка;
			НоваяЗапись.РеквизитДокумента	= СтрокаТаблицы.РеквизитДокумента;
			НоваяЗапись.НомерКолонки 		= СтрокаТаблицы.НазваниеКолонки;
		КонецЕсли;
	КонецЦикла; 
	НаборЗаписей.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзDBFПриИзменении(Элемент)
	ОтображениеЗаголовка();	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеЗаголовка()
	Если Объект.ЗагрузитьИзDBF Тогда
		Элементы.СоответствиеНазваниеКолонки.Заголовок = "Название колонки";
	Иначе 
		Элементы.СоответствиеНазваниеКолонки.Заголовок = "Номер колонки";		
	КонецЕсли;
КонецПроцедуры








#КонецОбласти
